panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
/***************************************************************************//**
* File Name: cycfg_ble.c
* Version: 1.1
*
* Description:
* Bluetooth Low Energy (BLE) milddleware configuration.
* This file should not be modified. It was automatically generated by
* Bluetooth Configurator 1.1.0 build 291
*
********************************************************************************
* Copyright 2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cycfg_ble.h"

#if (CY_BLE_CORE == CY_BLE_CORE_DUAL) || (CY_BLE_CORE == __CORTEX_M)

#include "cy_flash.h"
#include "cy_ble_common.h"

#if(CY_BLE_MODE_PROFILE)

/*******************************************************************************
*  BLE GAP CONFIGURATION
*******************************************************************************/

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
    /* The timeout value of slow advertising with slow advertising interval parameters */
    static cy_stc_ble_gapp_adv_params_t cy_ble_gappAdvConfig[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                             CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .fastAdvIntervalMin = 0x0020u, 
            .fastAdvIntervalMax = 0x0030u, 
            .fastAdvTimeOut = 0x00u, 
            .slowAdvEnable = 0x00u, 
            .slowAdvIntervalMin = 0x0640u, 
            .slowAdvIntervalMax = 0x4000u, 
            .slowAdvTimeOut = 0x96u, 
        },
        /* Peripheral configuration 1 */
        {
            .fastAdvIntervalMin = 0x0020u, 
            .fastAdvIntervalMax = 0x0030u, 
            .fastAdvTimeOut = 0x1Eu, 
            .slowAdvEnable = 0x01u, 
            .slowAdvIntervalMin = 0x0640u, 
            .slowAdvIntervalMax = 0x4000u, 
            .slowAdvTimeOut = 0x96u, 
        },
    };

    /* Advertising parameters */
    cy_stc_ble_gapp_disc_param_t cy_ble_discoveryParam[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                       CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .advIntvMin = 0x0020u, 
            .advIntvMax = 0x0030u, 
            .advType = CY_BLE_GAPP_CONNECTABLE_UNDIRECTED_ADV, 
            .ownAddrType = 0x00u, 
            .directAddrType = 0x00u, 
            .directAddr = {0x00u, 0x00u, 0x00u, 0x50u, 0xA0u, 0x00u}, 
            .advChannelMap = 0x07u, 
            .advFilterPolicy = 0x00u, 
        },
        /* Peripheral configuration 1 */
        {
            .advIntvMin = 0x0020u, 
            .advIntvMax = 0x0030u, 
            .advType = CY_BLE_GAPP_CONNECTABLE_UNDIRECTED_ADV, 
            .ownAddrType = 0x00u, 
            .directAddrType = 0x00u, 
            .directAddr = {0x00u, 0x00u, 0x00u, 0x50u, 0xA0u, 0x00u}, 
            .advChannelMap = 0x07u, 
            .advFilterPolicy = 0x00u, 
        },
    };

    /* Advertising data */
    cy_stc_ble_gapp_disc_data_t cy_ble_discoveryData[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                     CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .advData = { 0x02u, 0x01u, 0x06u, 0x08u, 0x09u, 0x70u,
                0x36u, 0x78u, 0x62u, 0x6Cu, 0x65u, 0x32u,
                0x05u, 0x02u, 0xBBu, 0xBBu, 0x0Au, 0x18u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u }, 
            .advDataLen = 0x12u, 
        },
        /* Peripheral configuration 1 */
        {
            .advData = { 0x02u, 0x01u, 0x05u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u }, 
            .advDataLen = 0x03u, 
        },
    };

    /* Scan response data */
    cy_stc_ble_gapp_scan_rsp_data_t cy_ble_scanRspData[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                       CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .scanRspData = { 0x08u, 0x09u, 0x70u, 0x36u, 0x78u, 0x62u,
                0x6Cu, 0x65u, 0x32u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u }, 
            .scanRspDataLen = 0x09u, 
        },
        /* Peripheral configuration 1 */
        {
            .scanRspData = { 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,
                0x00u }, 
            .scanRspDataLen = 0x00u, 
        },
    };

    /* This array of type cy_stc_ble_gapp_disc_mode_info_t is present only when the
       BLE component is configured for Peripheral or Broadcaster GAP roles.
       It contains the Advertisement settings and also the Advertisement and
       Scan response data parameters entered in the customizer. This variable
       can be used by advanced users to change Advertisement settings,
       Advertisement or Scan response data in runtime.
    */
    cy_stc_ble_gapp_disc_mode_info_t cy_ble_discoveryModeInfo[CY_BLE_GAP_PERIPHERAL_COUNT +
                                                              CY_BLE_GAP_BROADCASTER_COUNT] =
    {
        /* Peripheral configuration 0 */
        {
            .discMode = 0x02u, 
            .advParam = &cy_ble_discoveryParam[0], 
            .advData = &cy_ble_discoveryData[0], 
            .scanRspData = &cy_ble_scanRspData[0], 
            .advTo = 0x00u, 
        },
        /* Peripheral configuration 1 */
        {
            .discMode = 0x01u, 
            .advParam = &cy_ble_discoveryParam[1], 
            .advData = &cy_ble_discoveryData[1], 
            .scanRspData = &cy_ble_scanRspData[1], 
            .advTo = 0x1Eu, 
        },
    };
#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
    /* Initializes the cy_stc_ble_gapc_disc_info_t cy_ble_discoveryInfo structure */
    static cy_stc_ble_gapc_scan_params_t cy_ble_gapcScanConfig[CY_BLE_GAP_CENTRAL_COUNT +
                                                               CY_BLE_GAP_OBSERVER_COUNT] =
    {
        
