panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
    };

    /* This array of type cy_stc_ble_gapc_disc_info_t is present only when
       the BLE component is configured for Central or Observer GAP roles.
       It contains the Scan settings entered in the customizer.
       This variable can be used by advanced users to change Scan
       settings in runtime.
    */
    cy_stc_ble_gapc_disc_info_t cy_ble_discoveryInfo[CY_BLE_GAP_CENTRAL_COUNT +
                                                     CY_BLE_GAP_OBSERVER_COUNT] =
    {
        
    };
#endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)*/

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
    /** Default device security */
    cy_stc_ble_gap_auth_info_t cy_ble_authInfo[CY_BLE_AUTH_INFO_COUNT] =
    {
        /* Security configuration 0 */
        {
            .security = (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_1 ), 
            .bonding = CY_BLE_GAP_BONDING, 
            .ekeySize = 0x10u, 
            .authErr = CY_BLE_GAP_AUTH_ERROR_NONE, 
            .pairingProperties = 0x01u, 
        },
    };
#endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) */


/*******************************************************************************
*  BLE GATT CONFIGURATION
*******************************************************************************/

#if (CY_BLE_GATT_ROLE_SERVER)
    static uint8_t cy_ble_attValues[CY_BLE_GATT_DB_ATT_VAL_COUNT] =
    {
        /* Device Name */
        (uint8_t)'p', (uint8_t)'6', (uint8_t)'x', (uint8_t)'b', (uint8_t)'l', (uint8_t)'e', (uint8_t)'2',

        /* Appearance */
        0xC0u, 0x00u,

        /* Service Changed */
        0x00u, 0x00u, 0x00u, 0x00u,

        /* Custom Characteristic */
        

        /* Custom Descriptor */
        0xD8u, 0xBBu, 0x25u, 0xD4u, 0x59u, 0x9Au, 0x77u, 0x99u, 0x8Eu, 0x4Eu, 0xCCu, 0x7Fu, 0x1Au, 0xA4u, 0x60u, 0xEDu,

        /* Custom Characteristic */
        

        /* System ID */
        0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u,

        /* Serial Number String */
        

        /* Manufacturer Name String */
    };

    #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
    static uint8_t cy_ble_attValuesCCCD[CY_BLE_GATT_DB_CCCD_COUNT];
    #endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */

    #if (CY_BLE_ATT_UUID_128_COUNT != 0u)
    static const uint8_t cy_ble_attUuid128[CY_BLE_ATT_UUID_128_COUNT][16u] =
    {
        
    };
    #endif /* defined(CY_BLE_ATT_UUID_128_COUNT) */

    static cy_stc_ble_gatts_att_gen_val_len_t cy_ble_attValuesLen[CY_BLE_GATT_DB_ATT_VAL_LEN_COUNT] =
    {
        { 0x0007u, (void *)&cy_ble_attValues[0] }, /* Device Name */
        { 0x0002u, (void *)&cy_ble_attValues[7] }, /* Appearance */
        { 0x0004u, (void *)&cy_ble_attValues[9] }, /* Service Changed */
        { 0x0002u, (void *)&cy_ble_attValuesCCCD[0] }, /* Client Characteristic Configuration */
        { 0x0000u, (void *)&cy_ble_attValues[13] }, /* Custom Characteristic */
        { 0x0000u, (void *)&cy_ble_attValues[13] }, /* Custom Descriptor */
        { 0x0000u, (void *)&cy_ble_attValues[29] }, /* Custom Characteristic */
        { 0x0002u, (void *)&cy_ble_attValuesCCCD[2] }, /* Client Characteristic Configuration */
        { 0x0008u, (void *)&cy_ble_attValues[29] }, /* System ID */
        { 0x0000u, (void *)&cy_ble_attValues[37] }, /* Serial Number String */
        { 0x0000u, (void *)&cy_ble_attValues[37] }, /* Manufacturer Name String */
    };

    /* GATT Data Base */
    static const cy_stc_ble_gatts_db_t cy_ble_gattDB[CY_BLE_GATT_DB_INDEX_COUNT] =
    {
        { 0x0001u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0005u, {{0x1800u, NULL}}                           },
        { 0x0002u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0003u, {{0x2A00u, NULL}}                           },
        { 0x0003u, 0x2A00u /* Device Name                         */, 0x01020001u /* rd    */, 0x0003u, {{0x0007u, (void *)&cy_ble_attValuesLen[0]}} },
        { 0x0004u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0005u, {{0x2A01u, NULL}}                           },
        { 0x0005u, 0x2A01u /* Appearance                          */, 0x01020001u /* rd    */, 0x0005u, {{0x0002u, (void *)&cy_ble_attValuesLen[1]}} },
        { 0x0006u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0009u, {{0x1801u, NULL}}                           },
        { 0x0007u, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x0009u, {{0x2A05u, NULL}}                           },
        { 0x0008u, 0x2A05u /* Service Changed                     */, 0x01200000u /* ind   */, 0x0009u, {{0x0004u, (void *)&cy_ble_attValuesLen[2]}} },
        { 0x0009u, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x0009u, {{0x0002u, (void *)&cy_ble_attValuesLen[3]}} },
        { 0x000Au, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Du, {{0xAAAAu, NULL}}                           },
        { 0x000Bu, 0x2803u /* Characteristic                      */, 0x00080001u /* wr    */, 0x000Du, {{0xBBBBu, NULL}}                           },
        { 0x000Cu, 0xBBBBu /* Custom Characteristic               */, 0x01080100u /* wr    */, 0x000Du, {{0x0000u, (void *)&cy_ble_attValuesLen[4]}} },
        { 0x000Du, 0xA41Au /* Custom Descriptor                   */, 0x09000000u /*       */, 0x000Du, {{0x0000u, (void *)&cy_ble_attValuesLen[5]}} },
        { 0x000Eu, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0011u, {{0xBBBBu, NULL}}                           },
        { 0x000Fu, 0x2803u /* Characteristic                      */, 0x00100001u /* ntf   */, 0x0011u, {{0xCCCCu, NULL}}                           },
        { 0x0010u, 0xCCCCu /* Custom Characteristic               */, 0x01100000u /* ntf   */, 0x0011u, {{0x0000u, (void *)&cy_ble_attValuesLen[6]}} },
        { 0x0011u, 0x2902u /* Client Characteristic Configuration */, 0x030A0000u /* rd,wr */, 0x0011u, {{0x0002u, (void *)&cy_ble_attValuesLen[7]}} },
        { 0x0012u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0018u, {{0x180Au, NULL}}                           },
        { 0x0013u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0014u, {{0x2A23u, NULL}}                           },
        { 0x0014u, 0x2A23u /* System ID                           */, 0x01020001u /* rd    */, 0x0014u, {{0x0008u, (void *)&cy_ble_attValuesLen[8]}} },
        { 0x0015u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0016u, {{0x2A25u, NULL}}                           },
        { 0x0016u, 0x2A25u /* Serial Number String                */, 0x01020001u /* rd    */, 0x0016u, {{0x0000u, (void *)&cy_ble_attValuesLen[9]}} },
        { 0x0017u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0018u, {{0x2A29u, NULL}}                           },
        { 0x0018u, 0x2A29u /* Manufacturer Name String            */, 0x01020001u /* rd    */, 0x0018u, {{0x0000u, (void *)&cy_ble_attValuesLen[10]}} },
    };
#endif /* (CY_BLE_GATT_ROLE_SERVER) */


