panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
    };

    /* The configuration structure for the Blood Pressure service (server). */
    const cy_stc_ble_blss_config_t cy_ble_blssConfig =
    {
        .attrInfo = &cy_ble_blss,
    };
#endif /* CY_BLE_BLS_SERVER */

#ifdef CY_BLE_BLS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_blsc_t cy_ble_blsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Blood Pressure service (client). */
    const cy_stc_ble_blsc_config_t cy_ble_blscConfig =
    {
        .attrInfo       = cy_ble_blsc,
        .serviceDiscIdx = CY_BLE_SRVI_BLS,
    };
#endif /* CY_BLE_BLS_CLIENT */


/**
 * BCS
 **/
#ifdef CY_BLE_BCS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_bcss_t cy_ble_bcss =
    {
       
    };

    /* The configuration structure for the Body Composition service (server). */
    const cy_stc_ble_bcss_config_t cy_ble_bcssConfig =
    {
        .attrInfo = &cy_ble_bcss,
    };
#endif /* CY_BLE_BCS_SERVER */

#ifdef CY_BLE_BCS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_bcsc_t cy_ble_bcsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Body Composition service (client). */
    const cy_stc_ble_bcsc_config_t cy_ble_bcscConfig =
    {
        .attrInfo       = cy_ble_bcsc,
        .serviceDiscIdx = CY_BLE_SRVI_BCS,
    };
#endif /* CY_BLE_BCS_CLIENT */


/**
 * BMS
 **/
#ifdef CY_BLE_BMS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_bmss_t cy_ble_bmss =
    {
       
    };

    /* The configuration structure for the Bond Management service (server). */
    const cy_stc_ble_bmss_config_t cy_ble_bmssConfig =
    {
        .attrInfo = &cy_ble_bmss,
    };
#endif /* CY_BLE_BMS_SERVER */

#ifdef CY_BLE_BMS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_bmsc_t cy_ble_bmsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Bond Management service (client). */
    const cy_stc_ble_bmsc_config_t cy_ble_bmscConfig =
    {
        .attrInfo       = cy_ble_bmsc,
        .serviceDiscIdx = CY_BLE_SRVI_BMS,
    };
#endif /* CY_BLE_BMS_CLIENT */


/**
 * BTS
 **/
#ifdef CY_BLE_BTS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_btss_t cy_ble_btss =
    {
       
    };

    /* The configuration structure for the Bootloader service (server). */
    const cy_stc_ble_btss_config_t cy_ble_btssConfig =
    {
        .attrInfo = &cy_ble_btss,
    };
#endif /* CY_BLE_BTS_SERVER */


/**
 * CGMS
 **/
#ifdef CY_BLE_CGMS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_cgmss_t cy_ble_cgmss =
    {
       
    };

    /* The configuration structure for the Continuous Glucose Monitoring service (server). */
    const cy_stc_ble_cgmss_config_t cy_ble_cgmssConfig =
    {
        .attrInfo = &cy_ble_cgmss,
    };
#endif /* CY_BLE_CGMS_SERVER */

#ifdef CY_BLE_CGMS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_cgmsc_t cy_ble_cgmsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Continuous Glucose Monitoring service (client). */
    const cy_stc_ble_cgmsc_config_t cy_ble_cgmscConfig =
    {
        .attrInfo       = cy_ble_cgmsc,
        .serviceDiscIdx = CY_BLE_SRVI_CGMS,
    };
#endif /* CY_BLE_CGMS_CLIENT */


/**
 * CPS
 **/
#ifdef CY_BLE_CPS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_cpss_t cy_ble_cpss =
    {
       
    };

    /* The configuration structure for the Cycling Power Service service (server). */
    const cy_stc_ble_cpss_config_t cy_ble_cpssConfig =
    {
        .attrInfo = &cy_ble_cpss,
    };
#endif /* CY_BLE_CPS_SERVER */

#ifdef CY_BLE_CPS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_cpsc_t cy_ble_cpsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Cycling Power Service service (client). */
    const cy_stc_ble_cpsc_config_t cy_ble_cpscConfig =
    {
        .attrInfo       = cy_ble_cpsc,
        .serviceDiscIdx = CY_BLE_SRVI_CPS,
    };
#endif /* CY_BLE_CPS_CLIENT */


/**
 * CSCS
 **/
#ifdef CY_BLE_CSCS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_cscss_t cy_ble_cscss =
    {
       
    };

    /* The configuration structure for the Cycling Speed and Cadence service (server). */
    const cy_stc_ble_cscss_config_t cy_ble_cscssConfig =
    {
        .attrInfo = &cy_ble_cscss,
    };
#endif /* CY_BLE_CSCS_SERVER */

#ifdef CY_BLE_CSCS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_cscsc_t cy_ble_cscsc[CY_BLE_GATTC_COUNT];

    /* Flash storage for discovered attributes information */
    CY_SECTION(".cy_em_eeprom") CY_ALIGN(CY_FLASH_SIZEOF_ROW)
    static const cy_stc_ble_cscsc_t cy_ble_flashCscsc[CY_BLE_GATTC_COUNT] =
    {
        {
            .characteristics[CY_BLE_CSCS_CSC_MEASUREMENT] =
            {
                .charInfo    = { 0u, 0u                 },
                .endHandle   = 0u,
                .descriptors = { 0u }
            },
            .characteristics[CY_BLE_CSCS_CSC_FEATURE] =
            {
                .charInfo    = { 0u, 0u                 },
                .endHandle   = 0u,
                .descriptors = { 0u }
            },
            .characteristics[CY_BLE_CSCS_SENSOR_LOCATION] =
            {
                .charInfo    = { 0u, 0u                 },
                .endHandle   = 0u,
                .descriptors = { 0u }
            },
            .characteristics[CY_BLE_CSCS_SC_CONTROL_POINT] =
            {
                .charInfo    = { 0u, 0u                 },
                .endHandle   = 0u,
                .descriptors = { 0u }
            },
        }
    };

    /* The configuration structure for the Cycling Speed and Cadence service (client). */
    const cy_stc_ble_cscsc_config_t cy_ble_cscscConfig =
    {
        .attrInfo       = cy_ble_cscsc,
        .flashAtrInfo   = cy_ble_flashCscsc,
        .serviceDiscIdx = CY_BLE_SRVI_CSCS,
    };
#endif /* CY_BLE_CSCS_CLIENT */


/**
 * CTS
 **/
#ifdef CY_BLE_CTS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_ctss_t cy_ble_ctss =
    {
       
