panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
    };

    /* The configuration structure for the Current Time service (server). */
    const cy_stc_ble_ctss_config_t cy_ble_ctssConfig =
    {
        .attrInfo = &cy_ble_ctss,
    };
#endif /* CY_BLE_CTS_SERVER */

#ifdef CY_BLE_CTS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_ctsc_t cy_ble_ctsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Current Time service (client). */
    const cy_stc_ble_ctsc_config_t cy_ble_ctscConfig =
    {
        .attrInfo       = cy_ble_ctsc,
        .serviceDiscIdx = CY_BLE_SRVI_CTS,
    };
#endif /* CY_BLE_CTS_CLIENT */


/**
 * CUSTOM
 **/
#ifdef CY_BLE_CUSTOM_SERVER
    /* This array contains attribute handles for the defined descriptors
     * of Custom services.
     * The array index definitions are located in the cy_cfg.h file. */
    #if (CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_DESCRIPTORS_COUNT != 0u) 
    const cy_ble_gatt_db_attr_handle_t cy_ble_customSDesc[CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_DESCRIPTORS_COUNT] =
    {
        0x000Du, /* Handle of the Custom Descriptor descriptor */ 
        0x0011u, /* Handle of the Client Characteristic Configuration descriptor */
    };
    #endif /* (CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_DESCRIPTORS_COUNT != 0u) */
    
    /* This array contains attribute handles for the defined characteristics
     * of Custom services.
     * The array index definitions are located in the cy_cfg.h file. */
    #if (CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_COUNT != 0u) 
    const cy_stc_ble_customs_info_t cy_ble_customSChar[CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_COUNT] =
    {
        /* Custom Characteristic characteristic */
        {
            .customServCharHandle = 0x000Cu, /* Handle of the Custom Characteristic characteristic */ 
            .customServCharDesc = &cy_ble_customSDesc[0], /* Pointer to descriptors array */ 
        },
        /* Custom Characteristic characteristic */
        {
            .customServCharHandle = 0x0010u, /* Handle of the Custom Characteristic characteristic */ 
            .customServCharDesc = &cy_ble_customSDesc[1], /* Pointer to descriptors array */ 
        },
    };
    #endif /* (CY_BLE_CONFIG_CUSTOMS_SERVICE_CHAR_COUNT != 0u) */

    /* This array contains attribute handle and pointer to characteristic
    * information array for the defined of Custom services.
    * The array index definitions are located in the cy_cfg.h file. */
    const cy_stc_ble_customs_t cy_ble_customSServ[CY_BLE_CONFIG_CUSTOMS_SERVICE_COUNT] =
    {
        /* Custom Service service */
        {
            .customServHandle = 0x000Au, /* Handle of the Custom Service service */ 
            .customServInfo = &cy_ble_customSChar[0], /* Pointer to characteristics array */ 
        },
        /* Custom Notification service */
        {
            .customServHandle = 0x000Eu, /* Handle of the Custom Notification service */ 
            .customServInfo = &cy_ble_customSChar[1], /* Pointer to characteristics array */ 
        },
    };

    /** The configuration structure for the Custom services (server). */
    const cy_stc_ble_customs_config_t cy_ble_customsConfig =
    {
        .attrInfo = cy_ble_customSServ,
    };
#endif /* CY_BLE_CUSTOM_SERVER */

#ifdef CY_BLE_CUSTOM_CLIENT
    static uint16_t cy_ble_customCServHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};

    #if (CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT != 0u)
    static uint16_t cy_ble_customCCharHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    static uint16_t cy_ble_customCCharEndHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    static uint8 cy_ble_customCCharProperties[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT][CY_BLE_GATTC_COUNT] = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    #endif /* (CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT != 0u) */

    #if (CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT != 0u)
    static uint16_t cy_ble_customCDescHandle[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT][CY_BLE_GATTC_COUNT]  = {CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE};
    #endif /* (CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT != 0u) */

    #if (CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT != 0u)
    static const cy_stc_ble_uuid128_t cy_ble_customCUuid128[CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT] =
    {
        
    };
    #endif /* (CY_BLE_CONFIG_CUSTOMC_UUID_128_COUNT != 0u) */

    #if (CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT != 0u)
    static const uint16_t cy_ble_customCUuid16[CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT] =
    {
        
    };
    #endif /* (CY_BLE_CONFIG_CUSTOMC_UUID_16_COUNT != 0u) */

    static const cy_stc_ble_customc_desc_t cy_ble_customCDesc[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_DESCRIPTORS_COUNT] =
    {
        
    };
    static const cy_stc_ble_customc_char_t cy_ble_customCChar[CY_BLE_CONFIG_CUSTOMC_SERVICE_CHAR_COUNT] =
    {
        
    };
    const cy_stc_ble_customc_t cy_ble_customCServ[CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT] =
    {
        
    };

    /** The configuration structure for the Custom services (client). */
    const cy_stc_ble_customc_config_t cy_ble_customcConfig =
    {
        .attrInfo = cy_ble_customCServ,
        .serviceCount = CY_BLE_CONFIG_CUSTOMC_SERVICE_COUNT,
        .serviceDiscIdx = CY_BLE_SRVI_CUSTOMS,
    };
#endif /* CY_BLE_CUSTOM_CLIENT */


/**
 * DIS
 **/
#ifdef CY_BLE_DIS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_diss_t cy_ble_diss =
    {
        .serviceHandle = 0x0012u, /* Handle of the DIS service */ 
        .charHandle = {
            0x0018u, /* Handle of the Manufacturer Name String characteristic */ 
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Model Number String characteristic */ 
            0x0016u, /* Handle of the Serial Number String characteristic */ 
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Hardware Revision String characteristic */ 
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Firmware Revision String characteristic */ 
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Software Revision String characteristic */ 
            0x0014u, /* Handle of the System ID characteristic */ 
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the IEEE 11073-20601 Regulatory Certification Data List characteristic */ 
            CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the PnP ID characteristic */ 
        },
    };

    /* The configuration structure for the Device Information service (server) */
    const cy_stc_ble_diss_config_t cy_ble_dissConfig =
    {
        .attrInfo = &cy_ble_diss,
    };
#endif /* CY_BLE_DIS_SERVER */

#ifdef CY_BLE_DIS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_disc_t cy_ble_disc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Device Information service  (client) */
    const cy_stc_ble_disc_config_t cy_ble_discConfig =
    {
        .attrInfo       = cy_ble_disc,
        .serviceDiscIdx = CY_BLE_SRVI_DIS,
    };
#endif /* CY_BLE_DIS_CLIENT */


/**
 * ESS
 **/
#ifdef CY_BLE_ESS_SERVER

    /* Descriptor Value Changed characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx0[0x00u] =
    {
        
