panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
    };
    #endif /* Count of Descriptor Value Changed characteristic data != 0 */

    /* Apparent Wind Direction characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx1[0x00u] =
    {
        
    };
    #endif /* Count of Apparent Wind Direction characteristic data != 0 */

    /* Apparent Wind Speed characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx2[0x00u] =
    {
        
    };
    #endif /* Count of Apparent Wind Speed characteristic data != 0 */

    /* Dew Point characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx3[0x00u] =
    {
        
    };
    #endif /* Count of Dew Point characteristic data != 0 */

    /* Elevation characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx4[0x00u] =
    {
        
    };
    #endif /* Count of Elevation characteristic data != 0 */

    /* Gust Factor characteristic data */
    #if (0x00u != 0x00u)   
    static const cy_stc_ble_esss_char_t esssCharIdx5[0x00u] =
    {
        
    };
    #endif /* Count of Gust Factor characteristic data != 0 */

    /* Heat Index characteristic data */
    #if (0x00u != 0x00u)    
    static const cy_stc_ble_esss_char_t esssCharIdx6[0x00u] =
    {
        
    };
    #endif /* Count of Heat Index characteristic data != 0 */
    
    /* Humidity characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx7[0x00u] =
    {
        
    };
    #endif /* Count of Humidity characteristic data != 0 */

    /* Irradiance characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx8[0x00u] =
    {
        
    };
    #endif /* Count of Irradiance characteristic data != 0 */

    /* Pollen Concentration characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx9[0x00u] =
    {
        
    };
    #endif /* Count of Pollen Concentration characteristic data != 0 */

    /* Rainfall characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx10[0x00u] =
    {
        
    };
    #endif /* Count of Rainfall characteristic data != 0 */

    /* Pressure characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx11[0x00u] =
    {
         
    };
    #endif /* Count of Pressure characteristic data != 0 */

    /* Temperature characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx12[0x00u] =
    {
         
    };
    #endif /* Count of Temperature characteristic data != 0 */

    /* True Wind Direction characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx13[0x00u] =
    {
         
    };
    #endif /* Count of True Wind Direction characteristic data != 0 */

    /* True Wind Speed characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx14[0x00u] =
    {
         
    };
    #endif /* Count of True Wind Speed characteristic data != 0 */

    /* UV Index characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx15[0x00u] =
    {
         
    };
    #endif /* Count of UV Index characteristic data != 0 */

    /* Wind Chill characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx16[0x00u] =
    {
         
    };
    #endif /* Count of Wind Chill characteristic data != 0 */

    /* Barometric Pressure Trend characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx17[0x00u] =
    {
         
    };
    #endif /* Count of Barometric Pressure Trend characteristic data != 0 */

    /* Magnetic Declination characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx18[0x00u] =
    {
         
    };
    #endif /* Count of Magnetic Declination characteristic data != 0 */

    /* Magnetic Flux Density - 2D characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx19[0x00u] =
    {
         
    };
    #endif /* Count of Magnetic Flux Density - 2D characteristic data != 0 */

    /* Magnetic Flux Density - 3D characteristic data */
    #if (0x00u != 0x00u)
    static const cy_stc_ble_esss_char_t esssCharIdx20[0x00u] =
    {
         
    };
    #endif /* Count of Magnetic Flux Density - 3D characteristic data != 0 */
    
    /* Number of ESS characteristics instances */
    static const uint8_t cy_ble_esssCharInstances[CY_BLE_CONFIG_ESS_CHAR_INST_COUNT] =
    {
         
    };

    const cy_stc_ble_esss_t cy_ble_esss =
    {
        
    };

    /* The configuration structure for the Environmental Sensing service (server). */
    const cy_stc_ble_esss_config_t cy_ble_esssConfig =
    {
        .attrInfo = &cy_ble_esss,
        .charInstances  = cy_ble_esssCharInstances,
    };

#endif /* CY_BLE_ESS_SERVER */

#ifdef CY_BLE_ESS_CLIENT
    /* Descriptor Value Changed characteristic data */
    #if (0x00u != 0x00u)  
    static cy_stc_ble_essc_char_t esscCharIdx0[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Descriptor Value Changed characteristic data != 0 */

    /* Apparent Wind Direction characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx1[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Apparent Wind Direction characteristic data != 0 */

    /* Apparent Wind Speed characteristic data */
    #if (0x00u != 0x00u)  
    static cy_stc_ble_essc_char_t esscCharIdx2[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Apparent Wind Speed characteristic data != 0 */

    /* Dew Point characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx3[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Dew Point characteristic data != 0 */

    /* Elevation characteristic data */
    #if (0x00u != 0x00u)    
    static cy_stc_ble_essc_char_t esscCharIdx4[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Elevation characteristic data != 0 */

    /* Gust Factor characteristic data */
    #if (0x00u != 0x00u)       
    static cy_stc_ble_essc_char_t esscCharIdx5[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Gust Factor characteristic data != 0 */

    /* Heat Index characteristic data */
    #if (0x00u != 0x00u)       
    static cy_stc_ble_essc_char_t esscCharIdx6[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Heat Index characteristic data != 0 */

    /* Humidity characteristic data */
    #if (0x00u != 0x00u)    
    static cy_stc_ble_essc_char_t esscCharIdx7[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Humidity characteristic data != 0 */

