panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
    /* Irradiance characteristic data */
    #if (0x00u != 0x00u)    
    static cy_stc_ble_essc_char_t esscCharIdx8[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Irradiance characteristic data != 0 */

    /* Pollen Concentration characteristic data */
    #if (0x00u != 0x00u)   
    static cy_stc_ble_essc_char_t esscCharIdx9[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Pollen Concentration characteristic data != 0 */
 
    /* Rainfall characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx10[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Rainfall characteristic data != 0 */

    /* Pressure characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx11[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Pressure characteristic data != 0 */

    /* Temperature characteristic data */
    #if (0x00u != 0x00u)    
    static cy_stc_ble_essc_char_t esscCharIdx12[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Temperature characteristic data != 0 */

    /* True Wind Direction characteristic data */
    #if (0x00u != 0x00u)    
    static cy_stc_ble_essc_char_t esscCharIdx13[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of True Wind Direction characteristic data != 0 */

    /* True Wind Speed characteristic data */
    #if (0x00u != 0x00u)    
    static cy_stc_ble_essc_char_t esscCharIdx14[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of True Wind Speed characteristic data != 0 */

    /* UV Index characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx15[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of UV Index characteristic data != 0 */

    /* Wind Chill characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx16[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Wind Chill characteristic data != 0 */

    /* Barometric Pressure Trend characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx17[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Barometric Pressure Trend characteristic data != 0 */

    /* Magnetic Declination characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx18[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Magnetic Declination characteristic data != 0 */

    /* Magnetic Flux Density - 2D characteristic data */
    #if (0x00u != 0x00u)   
    static cy_stc_ble_essc_char_t esscCharIdx19[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Magnetic Flux Density - 2D characteristic data != 0 */

    /* Magnetic Flux Density - 3D characteristic data */
    #if (0x00u != 0x00u)
    static cy_stc_ble_essc_char_t esscCharIdx20[CY_BLE_GATTC_COUNT][0x00u];
    #endif /* Count of Magnetic Flux Density - 3D characteristic data != 0 */

    /* Number of ESS characteristics instances */
    static const uint8_t cy_ble_esscCharInstances[CY_BLE_CONFIG_ESS_CHAR_INST_COUNT] = {
        
    };

    /* Structure for store discovered attributes information */
    const cy_stc_ble_essc_t cy_ble_essc[CY_BLE_GATTC_COUNT] =
    {
        
    };

    /* The configuration structure for the Environmental Sensing service (client). */
    const cy_stc_ble_essc_config_t cy_ble_esscConfig =
    {
        .attrInfo       = cy_ble_essc,
        .charInstances  = cy_ble_esscCharInstances,
        .serviceDiscIdx = CY_BLE_SRVI_ESS,
    };
#endif /* CY_BLE_ESS_CLIENT */


/**
 * GLS
 **/
#ifdef CY_BLE_GLS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_glss_t cy_ble_glss =
    {
       
    };

    /* The configuration structure for the Glucose service (server). */
    const cy_stc_ble_glss_config_t cy_ble_glssConfig =
    {
        .attrInfo = &cy_ble_glss,
    };
#endif /* CY_BLE_GLS_SERVER */

#ifdef CY_BLE_GLS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_glsc_t cy_ble_glsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Glucose service (client). */
    const cy_stc_ble_glsc_config_t cy_ble_glscConfig =
    {
        .attrInfo       = cy_ble_glsc,
        .serviceDiscIdx = CY_BLE_SRVI_GLS,
    };
#endif /* CY_BLE_GLS_CLIENT */


/**
 * HIDS
 **/
#ifdef CY_BLE_HIDS_SERVER
    /* Service GATT DB handles structures */
    /* HID Server Report characteristic */
    static const cy_stc_ble_hidss_report_t cy_ble_hidssReportArray[CY_BLE_CONFIG_HIDSS_REPORT_COUNT] =
    {
        
    };

    /* HID Service attribute handles */
    const cy_stc_ble_hidss_t cy_ble_hidss[CY_BLE_CONFIG_HIDSS_SERVICE_COUNT] =
    {
        
    };

    /* The configuration structure for the HID service (server) */
    const cy_stc_ble_hidss_config_t cy_ble_hidssConfig =
    {
        .attrInfo     = cy_ble_hidss,
        .serviceCount = CY_BLE_CONFIG_HIDSS_SERVICE_COUNT,
        .reportCount  = CY_BLE_CONFIG_HIDSC_REPORT_COUNT,
    };
#endif /* CY_BLE_HIDS_SERVER */

#ifdef CY_BLE_HIDS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_hidsc_t cy_ble_hidsc[CY_BLE_GATTC_COUNT]
                                   [CY_BLE_CONFIG_HIDSC_SERVICE_COUNT];

    /** The configuration structure for the HID service (client) */
    const cy_stc_ble_hidsc_config_t cy_ble_hidscConfig =
    {
        .attrInfo       = (cy_stc_ble_hidsc_t *)cy_ble_hidsc,
        .serviceCount   = CY_BLE_CONFIG_HIDSC_SERVICE_COUNT,
        .reportCount    = CY_BLE_CONFIG_HIDSC_REPORT_COUNT,
        .serviceDiscIdx = CY_BLE_SRVI_HIDS,
    };
#endif /* CY_BLE_HIDS_CLIENT */

/**
 * HPS
 **/
#ifdef CY_BLE_HPS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_hpss_t cy_ble_hpss =
    {
       
    };

    /* The configuration structure for the HTTP Proxy service (server). */
    const cy_stc_ble_hpss_config_t cy_ble_hpssConfig =
    {
        .attrInfo = &cy_ble_hpss,
    };
#endif /* CY_BLE_HPS_SERVER */

#ifdef CY_BLE_HPS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_hpsc_t cy_ble_hpsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the HTTP Proxy service (client). */
    const cy_stc_ble_hpsc_config_t cy_ble_hpscConfig =
    {
        .attrInfo       = cy_ble_hpsc,
        .serviceDiscIdx = CY_BLE_SRVI_HPS,
    };
#endif /* CY_BLE_HPS_CLIENT */


/**
 * HRS
 **/
#ifdef CY_BLE_HRS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_hrss_t cy_ble_hrss =
    {
       
