panda5mt/psoc63_ble_notify_rtos/psoc63_ble_notify_rtos_mainapp/GeneratedSource/cycfg_ble.c
    };

    /* The configuration structure for the Pulse Oximeter service (server). */
    const cy_stc_ble_plxss_config_t cy_ble_plxssConfig =
    {
        .attrInfo = &cy_ble_plxss,
    };
#endif /* CY_BLE_PLXS_SERVER */

#ifdef CY_BLE_PLXS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_plxsc_t cy_ble_plxsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Pulse Oximeter service (client). */
    const cy_stc_ble_plxsc_config_t cy_ble_plxscConfig =
    {
        .attrInfo       = cy_ble_plxsc,
        .serviceDiscIdx = CY_BLE_SRVI_PLXS,
    };
#endif /* CY_BLE_PLXS_CLIENT */


/**
 * RSCS
 **/
#ifdef CY_BLE_RSCS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_rscss_t cy_ble_rscss =
    {
       
    };

    /* The configuration structure for the Running Speed and Cadence service (server). */
    const cy_stc_ble_rscss_config_t cy_ble_rscssConfig =
    {
        .attrInfo = &cy_ble_rscss,
    };
#endif /* CY_BLE_RSCS_SERVER */

#ifdef CY_BLE_RSCS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_rscsc_t cy_ble_rscsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Running Speed and Cadence service (client). */
    const cy_stc_ble_rscsc_config_t cy_ble_rscscConfig =
    {
        .attrInfo       = cy_ble_rscsc,
        .serviceDiscIdx = CY_BLE_SRVI_RSCS,
    };
#endif /* CY_BLE_RSCS_CLIENT */


/**
 * RTUS
 **/
#ifdef CY_BLE_RTUS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_rtuss_t cy_ble_rtuss =
    {
       
    };

    /* The configuration structure for the Reference Time Update service (server). */
    const cy_stc_ble_rtuss_config_t cy_ble_rtussConfig =
    {
        .attrInfo = &cy_ble_rtuss,
    };
#endif /* CY_BLE_RTUS_SERVER */

#ifdef CY_BLE_RTUS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_rtusc_t cy_ble_rtusc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Reference Time Update service (client). */
    const cy_stc_ble_rtusc_config_t cy_ble_rtuscConfig =
    {
        .attrInfo       = cy_ble_rtusc,
        .serviceDiscIdx = CY_BLE_SRVI_RTUS,
    };
#endif /* CY_BLE_RTUS_CLIENT */


/**
 * SCPS
 **/
#ifdef CY_BLE_SCPS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_scpss_t cy_ble_scpss =
    {
        
    };

    /* The configuration structure for the Scan Parameter service (server) */
    const cy_stc_ble_scpss_config_t cy_ble_scpssConfig =
    {
        .attrInfo = &cy_ble_scpss,
    };
#endif /* CY_BLE_SCPS_SERVER */

#ifdef CY_BLE_SCPS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_scpsc_t cy_ble_scpsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Scan Parameter service (client) */
    const cy_stc_ble_scpsc_config_t cy_ble_scpscConfig =
    {
        .attrInfo       = cy_ble_scpsc,
        .serviceDiscIdx = CY_BLE_SRVI_SCPS,
    };
#endif /* CY_BLE_SCPS_CLIENT */


/**
 * TPS
 **/
#ifdef CY_BLE_TPS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_tpss_t cy_ble_tpss =
    {
        
    };

    /* The configuration structure for the Tx Power service (server) */
    const cy_stc_ble_tpss_config_t cy_ble_tpssConfig =
    {
        .attrInfo = &cy_ble_tpss,
    };
#endif /* CY_BLE_TPS_SERVER */

#ifdef CY_BLE_TPS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_tpsc_t cy_ble_tpsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Tx Power service (client) */
    const cy_stc_ble_tpsc_config_t cy_ble_tpscConfig =
    {
        .attrInfo       = cy_ble_tpsc,
        .serviceDiscIdx = CY_BLE_SRVI_TPS,
    };
#endif /* CY_BLE_TPS_CLIENT */


/**
 * WSS
 **/
#ifdef CY_BLE_WSS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_wsss_t cy_ble_wsss =
    {
        
    };

    /* The configuration structure for the Weight Scale service (server). */
    const cy_stc_ble_wsss_config_t cy_ble_wsssConfig =
    {
        .attrInfo = &cy_ble_wsss,
    };
#endif /* CY_BLE_WSS_SERVER */

#ifdef CY_BLE_WSS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_wssc_t cy_ble_wssc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Weight Scale service (client). */
    const cy_stc_ble_wssc_config_t cy_ble_wsscConfig =
    {
        .attrInfo       = cy_ble_wssc,
        .serviceDiscIdx = CY_BLE_SRVI_WSS,
    };
#endif /* CY_BLE_WSS_CLIENT */


/**
 * UDS
 **/
#ifdef CY_BLE_UDS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_udss_t cy_ble_udss =
    {
        
    };

    /* The configuration structure for the User Data service (server). */
    const cy_stc_ble_udss_config_t cy_ble_udssConfig =
    {
        .attrInfo = &cy_ble_udss,
    };
#endif /* CY_BLE_UDS_SERVER */

#ifdef CY_BLE_UDS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_udsc_t cy_ble_udsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the User Data service (client). */
    const cy_stc_ble_udsc_config_t cy_ble_udscConfig =
    {
        .attrInfo       = cy_ble_udsc,
        .serviceDiscIdx = CY_BLE_SRVI_UDS,
    };
#endif /* CY_BLE_UDS_CLIENT */

/**
 * WPTS
 **/
#ifdef CY_BLE_WPTS_SERVER
    /* Service GATT DB handles structure */
    const cy_stc_ble_wptss_t cy_ble_wptss =
    {
        
    };

    /* The configuration structure for the Wireless Power Transfer service (server). */
    const cy_stc_ble_wptss_config_t cy_ble_wptssConfig =
    {
        .attrInfo = &cy_ble_wptss,
    };
#endif /* CY_BLE_WPTS_SERVER */

#ifdef CY_BLE_WPTS_CLIENT
    /* Structure for store discovered attributes information */
    cy_stc_ble_wptsc_t cy_ble_wptsc[CY_BLE_GATTC_COUNT];

    /* The configuration structure for the Wireless Power Transfer service (client). */
    const cy_stc_ble_wptsc_config_t cy_ble_wptscConfig =
    {
        .attrInfo       = cy_ble_wptsc,
        .serviceDiscIdx = CY_BLE_SRVI_WPTS,
    };
#endif /* CY_BLE_WPTS_CLIENT */

#endif /* (CY_BLE_MODE_PROFILE) */
#endif /* (CY_BLE_CORE == CY_BLE_CORE_DUAL) || (CY_BLE_CORE == __CORTEX_M) */

/* [] END OF FILE */

